#+TITLE: Remastering Using Cubic
#+AUTHOR: Hippie Hacker
#+EMAIL: hh@ii.coop
#+CREATOR: ii.coop
#+DATE: 13th of February, 2019
#+PROPERTY: header-args:shell :results output code verbatim replace
#+PROPERTY: header-args:shell+ :prologue "exec 2>&1\n"
#+PROPERTY: header-args:shell+ :epilogue ":\n"
#+PROPERTY: header-args:shell+ :wrap "EXAMPLE :noeval t"
#+PROPERTY: header-args:shell+ :dir (symbol-value 'org-file-dir)
#+PROPERTY: header-args:tmate  :socket (symbol-value 'socket)
#+PROPERTY: header-args:tmate+ :session (concat (user-login-name) ":" (nth 4 (org-heading-components)))
#+PROPERTY: header-args:tmate+ :prologue (concat "cd " org-file-dir "\n") 
#+PROPERTY: header-args:sh :results output code verbatim replace
#+PROPERTY: header-args:sh+ :dir (file-name-directory buffer-file-name)
#+PROPERTY: header-args:sh+ :tangle iiusb/cubic.sh
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+STARTUP: showeverything

* Verify base Docker Image 

#+NAME: check docker image
#+BEGIN_SRC shell
docker images | grep iiusbi
#+END_SRC

#+RESULTS: check docker image
#+BEGIN_EXAMPLE :noeval t
Got permission denied while trying to connect to the Docker daemon socket at unix:///var/run/docker.sock: Get http://%2Fvar%2Frun%2Fdocker.sock/v1.39/images/json: dial unix /var/run/docker.sock: connect: permission denied
#+END_EXAMPLE

#+NAME: verify container works
#+BEGIN_SRC shell
docker run -i iiusb lsb_release -a
#+END_SRC

#+RESULTS: verify container works
#+BEGIN_EXAMPLE :noeval t
docker: Got permission denied while trying to connect to the Docker daemon socket at unix:///var/run/docker.sock: Post http://%2Fvar%2Frun%2Fdocker.sock/v1.39/containers/create: dial unix /var/run/docker.sock: connect: permission denied.
See 'docker run --help'.
#+END_EXAMPLE

